In [33]:
#python is a general purpose oops programing language with dynaic symentics(no variable declaration)

In [2]:
def check_palindrome(word):
    return word

In [3]:
check_palindrome('ajay')

'ajay'

In [4]:
a='lucky'
a[::-1]

'ykcul'

In [ ]:
a='mohan'
if a==a[::-1]:
 print(f'{a} palindrome')
else:
 print(f'{a} not a palindrome')


#b:int='anant'#if we declare a as int and we write a string then it will ignore the data type
#print(b)

In [1]:
def check_palindrome(word:str):
    if type(word)==str:
     word=word.upper()#if we use upper with number it will give an error
     if word==word[::-1]:
       return 'palindrome'
     else:
        return 'not a palindrome'
    else:
        return 'invalid data type'#this will work if the above if fails

In [3]:
check_palindrome('181')

'palindrome'

In [5]:
a:int = 'Mohan'
print(a)

Mohan

In [7]:
def give_fibo(n):
 fibo=[0,1]
 for i in range(n-2):
  last_num=fibo[-1]
  second_last_num=fibo[-2]
  next_num=last_num+second_last_num
  fibo.append(next_num)
      
 return fibo

In [8]:
give_fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [9]:
data = [34,65,654,76,856]
print(data[-1])
print(data[-2])

856
76

In [10]:
def check_prime(number):
    for i in range(2,number):
        if number % i == 0:
            return 'Not a Prime Number'
            break
            print('Happy Holi')
    else:
        return 'Prime Number'

In [11]:
check_prime(20)

'Not a Prime Number'

In [12]:
n = 5

for i in range(1,n+1):
  print(i * '* ')

*
* *
* * *
* * * *
* * * * *

In [6]:
n=5
for i in range(1,n+1):
  print(' '*(n-i)+i*'* ')

    *
   * *
  * * *
 * * * *
* * * * *

In [13]:
def print_star(n = 5, typ = 'left',shape = '*'):
  if typ  == 'left':
    space  = ''

  elif typ == 'right':
    space = '  '

  elif typ == 'mid':
    space = ' '

  for i in range(1,n+1):
    print(space*(n-i) + i*f'{shape} ')

In [15]:
print_star(5,'right','*')

        *
      * *
    * * *
  * * * *
* * * * *

In [20]:
def print_star(n=5,typ='left'):
  if typ=='left':
   space=''
  elif typ=='right':
   space='  '
  elif typ=='mid':
   space=' '


  for i in range(1,n+1):
   print(space*(n-i)+i*'* ')

In [21]:
print_star()

*
* *
* * *
* * * *
* * * * *

In [56]:
def sum_of_n_natural_numbers(n):
  result =0 
  for i in range(1,n+1):
    result +=i

  return result

In [57]:
sum_of_n_natural_numbers(6)

21

In [47]:
def factorial(n):
  result =1
  for i in range(1,n+1):
    result *=i

  return result

In [48]:
factorial(5)

120

In [58]:
def total_sales(*args):#using star we can write multiple arguments helps in unpacking and it is the feature of * not args
    print(args)

In [51]:
total_sales(1,2,4)

(1, 2, 4)

In [65]:
#sum of all the sales
def total_sales(*args):
   # return sum(args)
    result=0
    for i in args:
        result +=i
    return result

In [66]:
total_sales(1,2,4)

7

In [71]:
sales=[423,4234,2342,3,234,234234,23,3242,2424]
min(sales)

3

In [80]:
    sales=[423,4234,2342,3,234,234234,23,3242,2424]
    min_element=sales[0]
    for i in sales[1:]:
      if i <min_element:
         min_element=i
    print(min_element)

3

In [85]:
max_element=sales[0]
for i in sales[1:]:
  if i>max_element:
    max_element=i
print(max_element)

234234

In [115]:
def max_sales(*n):
 max_element=n[0]
 for i in n[1:]:
  if i>max_element:
    max_element=i
 print( max_element)

In [116]:
max_sales(213,123,23,132)

213

In [112]:
def minn(*data):
    min_ele = data[0]
    for i in data[1:]:
     if i<min_ele:
         min_ele=i
    return min_ele

In [113]:
minn(23,423,42,42)

23

In [121]:
#list comprihension
company=['ola','uber','rapido','indrive','adani','tata']
def add_hashtag(*company):
    result=[]
    for i in company:
     result.append('#'+i.upper())
    return result

In [122]:
add_hashtag('ola','uber')

['#OLA', '#UBER']

In [127]:
def store_records( name,age,sec,roll_no,Class):
    data={'name':name,'age':age,'sec':sec,'roll_no':roll_no,'Class':Class}
    import pandas as pd
    result=pd.DataFrame(data,index=[1])
    return result

In [131]:
display(store_records('niyati',12,'a',12,12))
display(store_records('niyati',12,'a',12,12))
display(store_records('niyati',12,'a',12,12))

     name  age sec  roll_no  Class
1  niyati   12   a       12     12

     name  age sec  roll_no  Class
1  niyati   12   a       12     12

     name  age sec  roll_no  Class
1  niyati   12   a       12     12

In [9]:
import pandas as pd
def students_record(**kwargs):#single star stores tupple and double star stores dictionary
    result=pd.DataFrame(kwargs,index=[1])
    return result

In [10]:
students_record(name='niyati',age = 20,sec= 'm1',roll_no=12)

     name  age sec  roll_no
1  niyati   20  m1       12

In [17]:
import pandas as pd
def students_record(**kwargs):
    print(kwargs)
    keys=list(kwargs)
    if type(keys[0])==str:
        result=pd.DataFrame(kwargs)
        return result
    else:
        result=pd.DataFrame(kwargs)
        return result

In [18]:
students_record(name=['niyati','kushu','ajay'],
                age=[12,21,12],
                roll_no=[101,102,103],
                address=['noida','gr noida','delhi'])

{'name': ['niyati', 'kushu', 'ajay'], 'age': [12, 21, 12], 'roll_no': [101, 102, 103], 'address': ['noida', 'gr noida', 'delhi']}

     name  age  roll_no   address
0  niyati   12      101     noida
1   kushu   21      102  gr noida
2    ajay   12      103     delhi